
&НаКлиенте
Процедура АдминистрированиеИнтернетПоддержкаИСервисы(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.ИнтернетПоддержкаИСервисы");
КонецПроцедуры

&НаКлиенте
Процедура АдминистрированиеНастройкиПользователейИПрав(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.НастройкиПользователейИПрав");
КонецПроцедуры

&НаКлиенте
Процедура АдминистрированиеНастройкиРаботыСФайлами(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.НастройкиРаботыСФайлами");
КонецПроцедуры

&НаКлиенте
Процедура АдминистрированиеОбслуживание(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.Обслуживание");
КонецПроцедуры

&НаКлиенте
Процедура АдминистрированиеОбщиеНастройки(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.ОбщиеНастройки");
КонецПроцедуры

&НаКлиенте
Процедура АдминистрированиеОрганайзер(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.Органайзер");
КонецПроцедуры

&НаКлиенте
Процедура АдминистрированиеПечатныеФормыОтчетыИОбработки(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.ПечатныеФормыОтчетыИОбработки");
КонецПроцедуры

&НаКлиенте
Процедура АдминистрированиеСинхронизацияДанных(Команда)
	ОткрытьФорму("Обработка.ПанельАдминистрированияБСП.Форма.СинхронизацияДанных");
КонецПроцедуры

&НаКлиенте
Процедура Задачи(Команда)
	ОткрытьФорму("Документ.Задачи.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПереписки(Команда)
	ОткрытьФорму("РегистрСведений.ИсторияПереписки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусов(Команда)
	ОткрытьФорму("РегистрСведений.ИсторияСтатусовЗадач.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Клиенты(Команда)
	ОткрытьФорму("Справочник.Клиенты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Проекты(Команда)
	ОткрытьФорму("Справочник.Проекты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СтатусыЗадач(Команда)
	ОткрытьФорму("Справочник.СтатусыЗадач.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛица(Команда)
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаСписка");
КонецПроцедуры
