Процедура ЗаполнитьЗначенияЗаполненияПриСозданииНаСервере(Объект,ЗначенияЗаполнения) Экспорт
	Для каждого стрктр из ЗначенияЗаполнения Цикл
		Объект[стрктр.Ключ] = стрктр.Значение;
	КонецЦикла;	
КонецПроцедуры	

Функция ПолучитьЗначениеКонстанты(Константа) Экспорт
	Возврат Константы[Константа].Получить();
КонецФункции	

Функция ПолучитьПараметрыРаботыПользователя() Экспорт
	
	СтруктураПараметров = Новый структура("СоздатьПользователя,РабочийСтолАдминистратора");
	
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи");
	Если Запрос.Выполнить().Пустой() Тогда
		СтруктураПараметров.СоздатьПользователя = Истина;
	Иначе	
		СтруктураПараметров.СоздатьПользователя = Ложь;	
		СтруктураПараметров.РабочийСтолАдминистратора = Пользователи.ЭтоПолноправныйПользователь();
	КонецЕсли;	
	
	Возврат СтруктураПараметров
	
КонецФункции            

Функция ПолучитьНастройкуПользователя(Объект, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Настройка", ?(ТипЗнч(Настройка) = Тип("Строка"),ПланыВидовХарактеристик.мз_ПраваИНастройки[Настройка],Настройка));
	Запрос.УстановитьПараметр("Объект", Объект);	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Значение
	|ИЗ
	|	РегистрСведений.мз_НастройкиПользователей
	|
	|ГДЕ
	|	Объект = &Объект
	|	И Настройка  = &Настройка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустоеЗначение = ?(ТипЗнч(Настройка) = Тип("Строка"),ПланыВидовХарактеристик.мз_ПраваИНастройки[Настройка],Настройка).ТипЗначения.ПривестиЗначение();
	
	Если Выборка.Количество() = 0 Тогда		
		Возврат ПустоеЗначение;	
	ИначеЕсли Выборка.Следующий() Тогда		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;		
	Иначе
		Возврат ПустоеЗначение;		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Процедура УстановитьНастройкуПользователя(Объект, Настройка, Значение) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.мз_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Настройка = ?(ТипЗнч(Настройка) = Тип("Строка"),ПланыВидовХарактеристик.мз_ПраваИНастройки[Настройка],Настройка);
	Запись.Значение = Значение;
	Запись.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
