Функция ПолучитьПараметрыРаботыПользователя() Экспорт
	
	СтруктураПараметров = Новый структура("СоздатьПользователя,РабочийСтолАдминистратора");
	
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи");
	Если Запрос.Выполнить().Пустой() Тогда
		СтруктураПараметров.СоздатьПользователя = Истина;
	Иначе	
		СтруктураПараметров.СоздатьПользователя = Ложь;	
		СтруктураПараметров.РабочийСтолАдминистратора = Пользователи.ЭтоПолноправныйПользователь();
	КонецЕсли;	
	
	Возврат СтруктураПараметров
	
КонецФункции            

Функция ПолучитьНастройкуПользователя(Объект, Настройка) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Настройка", ?(ТипЗнч(Настройка) = Тип("Строка"),ПланыВидовХарактеристик.ПраваИНастройки[Настройка],Настройка));
	Запрос.УстановитьПараметр("Объект", Объект);	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей
	|
	|ГДЕ
	|	Объект = &Объект
	|	И Настройка  = &Настройка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПустоеЗначение = ?(ТипЗнч(Настройка) = Тип("Строка"),ПланыВидовХарактеристик.ПраваИНастройки[Настройка],Настройка).ТипЗначения.ПривестиЗначение();
	
	Если Выборка.Количество() = 0 Тогда		
		Возврат ПустоеЗначение;	
	ИначеЕсли Выборка.Следующий() Тогда		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;		
	Иначе
		Возврат ПустоеЗначение;		
	КонецЕсли;
	
КонецФункции

