
Процедура УстановкаПараметровСеанса() Экспорт
	
	ПараметрыСеанса.мз_ВнешнийАдресИБ = Константы.мз_ВнешнийАдресИБ.Получить();
	ПараметрыСеанса.мз_Клиент = Пользователи.ТекущийПользователь().ФизическоеЛицо.Клиент;
		
	#Если НЕ ВнешнееСоединение Тогда
		ТекущийСтиль = мз_ОбщегоНазначения.ПолучитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"Стиль");			
		Если НЕ ТекущийСтиль = "" Тогда
			Попытка
				ГлавныйСтиль = БиблиотекаСтилей[ТекущийСтиль];
			Исключение
				ПодробнаяИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон("Не удалось установить главный стиль ""%1"" по причине:
				|%2",
				ТекущийСтиль,
				ПодробнаяИнформацияОбОшибке);
				ЗаписьЖурналаРегистрации(
				"Установка главного стиля приложения",
				УровеньЖурналаРегистрации.Предупреждение,
				,,
				ТекстОшибки);
			КонецПопытки;	 
		КонецЕсли;
		
		ИмяПользователя = ИмяПользователя();	
		МасштабФорм = мз_ОбщегоНазначения.ПолучитьНастройкуПользователя(Пользователи.ТекущийПользователь(),"МасштабФорм");
		Если НЕ МасштабФорм = "" Тогда 
			НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения",,,ИмяПользователя);
			Если НЕ НастройкиКлиентскогоПриложения = Неопределено Тогда
				НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения[МасштабФорм];
				ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", НастройкиКлиентскогоПриложения, , ИмяПользователя);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры
  
