// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// 1. Обновление общих данных.
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия          = "*";
	Обработчик.Процедура       = "мз_Служебный.ОбновитьДанныеСтатусов";		

	Обработчик = Обработчики.Добавить();
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Версия          = "1.1.1.1";
	Обработчик.Процедура       = "мз_Служебный.ОбновитьДанныеСтатусов";
	
КонецПроцедуры

Процедура ОбновитьДанныеСтатусов() Экспорт
	
	ВидСтПеревод = Перечисления.мз_ВидыСтатусов.ПереводПроцессаНаСледующийЭтап;
    ВидСтУспЗав = Перечисления.мз_ВидыСтатусов.УспешноеЗавершениеПроцесса;
	ВидСтОтказ = Перечисления.мз_ВидыСтатусов.ОтказОтПродолженияПроцесса;
	
	Об = Справочники.мз_СтатусыЗадач.Новая.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтПеревод;
	Об.ИндексСтатуса = 0;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.ВРаботе.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтПеревод;
	Об.ИндексСтатуса = 1;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.Выполненная.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтУспЗав;
	Об.ИндексСтатуса = 2;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.Отложенная.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтПеревод;
	Об.СпрашиватьПричинуИзменения = Истина;
	Об.ИндексСтатуса = 3;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.Отмененная.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтОтказ;
	Об.СпрашиватьПричинуИзменения = Истина;
	Об.ИндексСтатуса = 4;
	Об.Записать();
	
КонецПроцедуры