Функция ПолучитьПараметрыРаботыПользователя() Экспорт
	
	СтруктураПараметров = Новый структура("СоздатьПользователя,РабочийСтолАдминистратора");
	
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи");
	Если Запрос.Выполнить().Пустой() Тогда
		СтруктураПараметров.СоздатьПользователя = Истина;
	Иначе	
		СтруктураПараметров.СоздатьПользователя = Ложь;	
		СтруктураПараметров.РабочийСтолАдминистратора = Пользователи.ЭтоПолноправныйПользователь();
	КонецЕсли;	
	
	Возврат СтруктураПараметров
	
КонецФункции