
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспСложныеСтатусы = ПолучитьФункциональнуюОпцию("мз_ИспользоватьСложныеСтатусы");
	
	ТекФизЛицо = Пользователи.ТекущийПользователь().ФизическоеЛицо;
	Клиент = ТекФизЛицо.Клиент;	
	Если Параметры.Свойство("Клиент") Тогда
		ЭтаФорма.ОтображатьКнопкуЗакрытия = НЕ Параметры.Клиент;                	
		Элементы.ОтборКлиент.Видимость = Ложь;
		Элементы.Клиент.Видимость = Ложь;
	КонецЕсли;
	Элементы.Настройки.Видимость = НЕ Пользователи.ЭтоПолноправныйПользователь();
	УстановитьПараметрыДинамисческогоСписка();
	
	Если ИспСложныеСтатусы Тогда
		СтрОтбор = "мз_СтатусыЗадач.ОтображатьВОтборе = ИСТИНА";	
	Иначе	
		СтрОтбор = "мз_СтатусыЗадач.Предопределенный = ИСТИНА";
	КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	мз_СтатусыЗадач.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.мз_СтатусыЗадач КАК мз_СтатусыЗадач
	|ГДЕ
	|	" + СтрОтбор + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	мз_СтатусыЗадач.ИндексСтатуса");
	ЗВ = Запрос.Выполнить();
	Если НЕ ЗВ.Пустой() Тогда
		Таб = ЗВ.Выгрузить();
		Элементы.ОтборПоСтатусу.СписокВыбора.Добавить(Справочники.мз_СтатусыЗадач.ПустаяСсылка(),"Все");
		Для каждого стр из таб Цикл
			Элементы.ОтборПоСтатусу.СписокВыбора.Добавить(стр.Ссылка);		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрДинамисческогоСписка(Элемент)
	УстановитьПараметрыДинамисческогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
	Список.Параметры.УстановитьЗначениеПараметра("МоиЗадачи", МоиЗадачи);
	Список.Параметры.УстановитьЗначениеПараметра("ТекФизЛицо", ТекФизЛицо); 
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ТекФизЛицо.Исполнитель);
	Список.Параметры.УстановитьЗначениеПараметра("Статус", ОтборПоСтатусу);
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.мз_СменитьСтиль");
КонецПроцедуры
