
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Постановщик = Пользователи.ТекущийПользователь().ФизическоеЛицо;
	Клиент = Постановщик.Клиент;	
	Если Параметры.Свойство("Клиент") Тогда
		ЭтаФорма.ОтображатьКнопкуЗакрытия = НЕ Параметры.Клиент;                	
		Элементы.Клиент.Видимость = Ложь;
		Элементы.Настройки.Видимость = Параметры.Клиент;
	КонецЕсли;
	
	УстановитьПараметрыДинамисческогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрДинамисческогоСписка(Элемент)
	УстановитьПараметрыДинамисческогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
	Список.Параметры.УстановитьЗначениеПараметра("МоиЗадачи", МоиЗадачи);
	Список.Параметры.УстановитьЗначениеПараметра("Постановщик", Постановщик);
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.мз_СменитьСтиль");
КонецПроцедуры
