&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветИнтерфейса = ТМ_ОбщегоНазначения.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ЦветИнтерфейса");

КонецПроцедуры

&НаКлиенте
Процедура ЦветИнтерфейсаПриИзменении(Элемент)
	
	ЦветИнтерфейсаПриИзмененииНаСервере();
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
	ПоказатьВопрос(Оповещение, "Для применения нужно перезапустить программу. Перезапустить?", РежимДиалогаВопрос.ДаНет,10, КодВозвратаДиалога.Да,,КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаСервере
Процедура ЦветИнтерфейсаПриИзмененииНаСервере()
	
	Запись = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
	Запись.Объект = ПараметрыСеанса.ТекущийПользователь;
	Запись.Настройка = ПланыВидовХарактеристик.ПраваИНастройки.ЦветИнтерфейса;
	Запись.Значение = ЦветИнтерфейса;
    Запись.Записать(Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;	
	
КонецПроцедуры