
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Запись.Пользователь = Пользователи.ТекущийПользователь() Тогда
		Отказ = Истина;
	КонецЕсли;	
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Отказ = Ложь;
	Иначе	
		Элементы.Период.Видимость = Ложь;
		Элементы.Задача.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Ложь; 
		Элементы.ТекстСообщения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьПереписку",,Запись.Задача);
КонецПроцедуры
